kamien2/kamien2.tex
% Created 2023-05-21 Sun 16:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{placeholder}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={placeholder},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\begin{tabular}{|l|l|}
\hline
\multicolumn{2}{|l|}{Politechnika Świętokrzyska w Kielcach} \\
\multicolumn{2}{|l|}{Wydział Elektrotechniki,Automatyki I Informatyki} \\
\hline
\multicolumn{2}{|l|}{Podstawy Programownaia 2 - Projekt} \\
\multicolumn{2}{|l|}{Informatyka - I Rok akademicki 2022/2023} \\
\hline
Temat Projektu: & Wykonali: \\
Wypożyczalnia Samochodów & 1. Rafał Grot \\
 & 2. Kamil Gunia \\
 & 3. Jakub Grzelec \\
 & 4. Karina Goszczyńska \\
\hline
\end{tabular}
\end{center}
\section{Pierwszy kamień milowy}
\label{sec:org0868b6d}
\subsection{Opanowanie systemu kotroli wersji \texttt{git}.}
\label{sec:org7cfee6d}
Mogło być lepiej ale damy radę.
\subsection{Podział pracy w zespole.}
\label{sec:org5f23452}
Mogło być lepiej ale damy radę.
\subsection{Projekt relacyjniej bazy danych samochodów, klientów, wypożyczeń.}
\label{sec:orgcf55330}
Jest.
\subsection{Zapoznanie się z biblioteką \texttt{sqlite} \url{https://www.sqlite.org} ,nauka tworzenia i wykonwywania porstych kwerend za jej pomocą.}
\label{sec:orgafba54a}
Mogło być lepiej ale damy radę.
\subsection{Wstępna implementacja interfejsu użytkownia.}
\label{sec:orgfbf637d}
Jest.
\subsection{Testowanie poprawności działania menu.}
\label{sec:orgd133aa4}
Działa.
\subsection{Przygotowanie sprawozdania z postępów prac nad projektem.}
\label{sec:org490366f}
Jest.
\subsection{Podsumowanie co się udało/nie udało}
\label{sec:org945ea0a}
Jest powyżej.
Dodatkowo połowa zespołu opanowała Doxygen oraz podstawy biblioteki \texttt{ncurses}.
Została napisana implementacja podwójnie linkowanej listy.
\section{Drugi kamień milowy}
\label{sec:org3c67d8f}
\subsection{Implementacja bazy danych.}
\label{sec:org8632342}
Była na 1 KM.
\subsection{Implementacja dodawania, usuwania oraz modyfikacji -- Samochodów i kilentów.}
\label{sec:org02b9fd2}
W trakcie, ze wzgłedu na podjęte decyzje usuwanie oraz modyfkacja wymaga wyświetlania.
\subsection{Implementacja wypożyczania i oddawania samochodów}
\label{sec:orgd6d5481}
Do realizacja jest wymagana implementacjia samochodów.
\subsection{Wyświetlanie samochodów z możliwością sortowania rosnącego/malejącego.}
\label{sec:orgeb6a5b1}
W trakcie.
\subsection{Podsumowanie}
\label{sec:org4a3f6c9}
Wczytywanie listy klientów działa prawidłowo, wraz z sortowaniem.
Pomimo prawidłowego wczytania listy oraz sortowania, skutek sortowania jest nie widoczny na ekranie.
\section{I termin}
\label{sec:org9489915}
\begin{enumerate}
\item Stworzenie dokumentacji w porgramie \texttt{Doxygen}
\item Sporządzenie sprawodzania.
\item Dodanie ewentualnych ulepszeń.
\end{enumerate}
\end{document}